app/controllers/school_classes_controller.rb

  def create
    @schoolclass = SchoolClass.create(schoolclass_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Social Studies"], ["room_number", 300], ["created_at", "2019-06-07 15:56:16.673401"], ["updated_at", "2019-06-07 15:56:16.673401"]]

  def update
    @schoolclass = SchoolClass.find(params[:id])
    @schoolclass.update(schoolclass_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-06-07 16:57:39.463196"], ["id", 1]]